using System;
using System.Collections.Generic;
using System.IO;
using System.Text;
using System.Linq;

namespace Parser
{
    public class NameData
    {
        public string ScName { get; set; }
        public string Name { get; set; }
        public string SocrName { get; set; }
        public string Code { get; set; }
    }
    public static class NameHelper
    {
        public static NameData[] NameData;

        static NameHelper()
        {
            var lines = File.ReadAllLines("names.csv");
            NameData = new NameData[lines.Length];
            for (int i = 0; i < lines.Length; i++)
            {
                var spl = lines[i].Split('\t');
                NameData[i] = new NameData(){ScName = spl[0], Name = spl[1], SocrName = spl[2], Code = spl[3]}; 
            }
        }

        public static NameData SearchName(string searchPattern)
        {
            var scScores = new double[NameData.Length];
            
            for (int i = 0; i < NameData.Length; i++)
            {
                var scDistance = Accord.Math.Distance.Levenshtein(searchPattern, NameData[i].Name);
                if (scDistance == 0)
                {
                    return NameData[i];
                }
                else
                {
                    scScores[i] = scDistance;
                }

                
            }

            var index = Array.IndexOf(scScores, scScores.Min(s => s));
            return NameData[index % NameData.Length];
        }

        public static string[] SubwayPrefix =
        {
            "м.", "м. ", "М.", "М. "
        };

        public static string[] SubwayNames =
 {
            "Авиамоторная", "Авиамоторная", "Автозаводская", "Академическая", "Александровский сад", "Алексеевская",
            "Алма-Атинская", "Алтуфьево", "Аннино", "Арбатская", "Арбатская", "Аэропорт", "Бабушкинская",
            "Багратионовская", "Баррикадная", "Бауманская", "Беговая", "Беломорская", "Белорусская", "Белорусская",
            "Беляево", "Бибирево", "Библиотека имени Ленина", "Битцевский парк", "Борисово", "Боровицкая",
            "Боровское шоссе", "Ботанический сад", "Братиславская", "Бульвар Адмирала Ушакова",
            "Бульвар Дмитрия Донского", "Бульвар Рокоссовского", "Бунинская аллея", "Бутырская", "Варшавская", "ВДНХ",
            "Верхние Лихоборы", "Владыкино", "Водный стадион", "Войковская", "Волгоградский проспект", "Волжская",
            "Волоколамская", "Воробьёвы горы", "Выставочная", "Выставочный центр", "Выхино", "Говорово",
            "Деловой центр", "Деловой центр", "Динамо", "Дмитровская", "Добрынинская", "Домодедовская", "Достоевская",
            "Дубровка", "Жулебино", "Зябликово", "Измайловская", "Калужская", "Кантемировская", "Каховская",
            "Каширская", "Каширская", "Киевская", "Киевская", "Киевская", "Китай-город", "Китай-город", "Кожуховская",
            "Коломенская", "Коммунарка", "Комсомольская", "Комсомольская", "Коньково", "Косино", "Котельники",
            "Красногвардейская", "Краснопресненская", "Красносельская", "Красные Ворота", "Крестьянская застава",
            "Кропоткинская", "Крылатское", "Кузнецкий Мост", "Кузьминки", "Кунцевская", "Кунцевская", "Курская",
            "Курская", "Кутузовская", "Ленинский проспект", "Лермонтовский проспект", "Лесопарковая", "Лефортово",
            "Ломоносовский проспект", "Лубянка", "Лухмановская", "Люблино", "Марксистская", "Марьина Роща", "Марьино",
            "Маяковская", "Медведково", "Международная", "Менделеевская", "Минская", "Митино", "Мичуринский проспект",
            "Молодёжная", "Мякинино", "Нагатинская", "Нагорная", "Название станции", "Нахимовский проспект",
            "Некрасовка", "Нижегородская", "Новогиреево", "Новокосино", "Новокузнецкая", "Новопеределкино",
            "Новослободская", "Новоясеневская", "Новые Черёмушки", "Озёрная", "Окружная", "Окская", "Октябрьская",
            "Октябрьская", "Октябрьское Поле", "Ольховая", "Орехово", "Отрадное", "Охотный Ряд", "Павелецкая",
            "Павелецкая", "Парк культуры", "Парк культуры", "Парк Победы", "Парк Победы", "Партизанская",
            "Первомайская", "Перово", "Петровский парк", "Петровско-Разумовская", "Петровско-Разумовская", "Печатники",
            "Пионерская", "Планерная", "Площадь Ильича", "Площадь Революции", "Полежаевская", "Полянка", "Пражская",
            "Преображенская площадь", "Прокшино", "Пролетарская", "Проспект Вернадского", "Проспект Мира",
            "Проспект Мира", "Профсоюзная", "Пушкинская", "Пятницкое шоссе", "Раменки", "Рассказовка", "Речной вокзал",
            "Рижская", "Римская", "Румянцево", "Рязанский проспект", "Савёловская", "Савёловская", "Саларьево",
            "Свиблово", "Севастопольская", "Селигерская", "Семёновская", "Серпуховская", "Славянский бульвар",
            "Смоленская", "Смоленская", "Сокол", "Сокольники", "Солнцево", "Спартак", "Спортивная",
            "Сретенский бульвар", "Стахановская", "Строгино", "Студенческая", "Сухаревская", "Сходненская", "Таганская",
            "Таганская", "Тверская", "Театральная", "Текстильщики", "Телецентр", "Тёплый Стан", "Технопарк",
            "Тимирязевская", "Тимирязевская", "Третьяковская", "Третьяковская", "Тропарёво", "Трубная", "Тульская",
            "Тургеневская", "Тушинская", "Улица 1905 года", "Улица Академика Королёва", "Улица Академика Янгеля",
            "Улица Горчакова", "Улица Дмитриевского", "Улица Милашенкова", "Улица Сергея Эйзенштейна",
            "Улица Скобелевская", "Улица Старокачаловская", "Университет", "Филатов луг", "Филёвский парк", "Фили",
            "Фонвизинская", "Фрунзенская", "Ховрино", "Хорошёвская", "Царицыно", "Цветной бульвар", "ЦСКА",
            "Черкизовская", "Чертановская", "Чеховская", "Чистые пруды", "Чкаловская", "Шаболовская", "Шелепиха",
            "Шипиловская", "Шоссе Энтузиастов", "Щёлковская", "Щукинская", "Электрозаводская", "Юго-Восточная",
            "Юго-Западная", "Южная", "Ясенево", "Метро Питера", "Автово", "Академическая", "Балтийская", "Владимирская",
            "Выборгская", "Гражданский проспект", "Девяткино", "Кировский завод", "Ленинский проспект", "Лесная",
            "Нарвская", "Площадь Восстания", "Площадь Ленина", "Площадь Мужества", "Политехническая",
            "Проспект Ветеранов", "Пушкинская", "Технологический институт", "Чернышевская", "Адмиралтейская",
            "Бухарестская", "Волковская", "Звенигородская", "Комендантский проспект", "Крестовский остров",
            "Международная", "Обводный канал", "Садовая", "Спортивная", "Старая Деревня", "Чкаловская",
            "Василеостровская", "Гостиный двор", "Елизаровская", "Ломоносовская", "Маяковская", "Обухово",
            "Площадь Александра Невского-1", "Приморская", "Пролетарская", "Рыбацкое", "Горьковская", "Звёздная",
            "Купчино", "Московская", "Московские ворота", "Невский проспект", "Озерки", "Парк Победы", "Парнас",
            "Петроградская", "Пионерская", "Проспект Просвещения", "Сенная площадь", "Технологический институт",
            "Удельная", "Фрунзенская", "Чёрная речка", "Электросила", "Достоевская", "Ладожская", "Лиговский проспект",
            "Новочеркасская", "Площадь Александра Невского-2", "Проспект Большевиков", "Спасская", "Улица Дыбенко"
        };
    }
}
